{"podcast_details": {"podcast_title": "I've Never Said This Before With Tommy DiDario", "episode_title": "Matthew López", "episode_image": "https://www.omnycontent.com/d/programs/e73c998e-6e60-432f-8610-ae210140c5b1/c0f1ef61-43d6-49c6-960b-b02101488258/image.jpg?t=1687232817&size=Large", "episode_transcript": " You're ready for a comeback. And with Purdue Global, you can do more than take classes. You can take charge of your story, of your career, of your life. Earn a degree you can be proud of and get an education employers respect. It's time, your time, not just to go back to school, but to come back and move forward with Purdue Global, Purdue's online university for working adults. Start your comeback at PurdueGlobal.edu. He'll forget about the video game you gave him on his birthday. Wow, thanks, Grandpa. But he'll never forget how you invested in his future with the UNEST app. Wow, thanks, Grandpa. The UNEST app makes it easy for grandparents and family friends to give funds to a child's investment account for a limited time. Download the UNEST app and use the code IHEART50 at sign up to receive a $50 bonus when you fund your account. That's code IHEART50 when you sign up at UNEST.CO for a $50 bonus. See terms and conditions at unest.co. Curiosity Stream is the streaming service for people who want to know more. And now check out Curiosity's new series, Queens of Ancient Egypt. When pharaohs held the throne, their wives held the power. We see her taking precedence over the pharaoh, an absolute mastermind. All hail the queens. This is unprecedented. Watch Queens of Ancient Egypt now on Curiosity Stream. With monthly annual and bundled plans, find the one that works for you at curiositystream.com. Hey guys, welcome to I've Never Said This Before with me, Tommy D'Addario. Today's guest is the brilliant Matthew Lopez. He's a director, a screenwriter, and a Tony award-winning playwright. And on top of that, Tony, add on maybe six or seven other noteworthy awards for his play, The Inheritance, which I was lucky enough to see on Broadway and I was so incredibly moved by. And being the theater geek that I am, I also saw another show he co-wrote, which was the musical adaptation for Some Like It Hot, also fantastic. But today we are diving into Red, White, and Royal Blue, one of the most anticipated movies of the year that Matthew co-wrote and directed. Now this film is an adaptation of the bestselling novel by Casey McQuiston, and I would say it's arguably one of the most popular books ever written. So here's the story. Alex is the son of the American president, and he is in a feud with Prince Henry of Britain, and at one event that they both are attending, that feud becomes pretty public when it comes to a head. So to prevent a wedge from being driven into the US and British relations, Alex and Prince Henry are forced to stage a truce that, well, it sparks something unexpected and deeper than anyone could have imagined, and I think you can guess some love ensues. Matthew brings his queer love story from the pages to the screen in the most beautiful way, and let's just say while watching this, mm, yeah, I shed quite a few tears. I know, I know, I am a sucker for love, what can I say? So let's see if today we can get Matthew to say something that he's never said before. Matthew, how are you, my friend? I'm doing really well, thanks. Good, I'm so happy you're here. I know you've had a crazy few days, you've been on a whirlwind tour for this movie, which we're gonna get all into. I have to tell you, ah, ah, what can I say that will truly convey what it felt like watching this movie in that theater on Monday night at the screening? I mean, my husband and I went crazy over it. We laughed, we cried, we cheered, all the things and more. You did such a brilliant job with this movie. Congratulations. Thank you, thank you. I know it's your first film. Why did you wanna make Red, White and Royal Blue? It was about February, February of 2020, and my agent sent me the book, and I had just opened Inheritance on Broadway, and I was looking to do something new. I wanted to start looking for a film to make, and then this book came along. And I just knew about page 50, I kinda knew that this was the thing I wanted to do. And it was, and then the rest of the book was essentially me already starting to figure out how I might be able to make a film work out of this book. And I found out that Greg Berlanti, who was one of the producers of The Inheritance, had acquired the rights. And I lobbied him and Sarah Schechter, his business partner, and eventually, you know, they came to me and said, yeah, let's do this. And then that became the last two and a half years of my life. I really, really responded so much to the optimism of the book. I really loved the fact that it was this queer romance with a happy ending, and with really idiosyncratic, vibrant characters. I loved that there was a Latine, bisexual, southern boy in the lead. You know, there's so much I could relate to in this book. And, you know, when you contemplate spending two years working on something, you had better really like it, and you better really be excited about it. Or you better really be excited about the paycheck, I guess. But for me, I really needed my first film to be something that I was passionate about, that I was gonna sacrifice sleep for. And this was it, for sure. So you said you were reading it, and then 50 pages in, you knew you had to make this a movie. What was that defining moment for you? I probably, the fans of the book will tell me how wrong I am at this. So it's probably not at page 50, but their first kiss, I think the way Casey described the first kiss was so cinematic, I could see the movie. The movie was just unspooling in my head as I was reading it. And I love that it was this, you know, New Year's Eve and snowy White House grounds. I thought there was something just inherently cinematic about so much of the book. And I really kind of fell for the swoony, romantic quality of Casey's writing. Yeah, and the two leads bring this story to life brilliantly. I know you spent five or six months auditioning hundreds of different actors. You found Taylor, you found Nicholas. Why were they the right guys to play these roles? It's funny, after having made the film with them, it almost becomes really difficult to explain why they're the most, the perfect guys from the roles, because they are just simply now the roles. You forget what the casting process was like, and I've had to really go back and actually watch some of their auditions recently. And I remember watching Nick audition and working with Nick. He really convinced me that what Henry needed was a caretaker. And what Nick was able to do as the actor playing the role was less inhabit him than care for him. He really, really protected Henry. He really felt very protective of Henry. He, I think, as an actor saw his job as being someone who had to just sort of create a wall around Henry and keep bad things from happening to him. And there was such an enormous well of compassion for Henry, and I knew that with Nick, I was leaving this character in very good hands, and I could, I didn't need to worry about Henry, and I could focus on other things. And with Taylor, Taylor has this ability to transform himself, both his body and his energy into something else. He's a real chameleon, and he's a shapeshifter. And when I started reading him for this role, I could see Alex just sort of springing to life. And so there's, it's funny, there's this very complimentary energy that they have as actors, at least on this film, that Nick was very sort of internal, and Taylor was very external. There was some sort of inward energy coming toward Nick, and there was some outward energy coming from Taylor. And so that, independently of each other, they were already, without having met, were creating these very complimentary performances, just even in the auditions. And then I put them on a Zoom together to do a chemistry read, and just sort of like praying and hoping that, oh my God, please, please, please, just if it's not true, give me enough that I can fake it. And they didn't need, I didn't need to fake anything, and neither did they. It was just there from the beginning. It was, I mean, it's gonna sound stupid to say, but it just sounded like fate. It just was so perfect. They were the characters. They became the characters more and more throughout the audition process, and then when we got into this chemistry read, they just clicked instantly. So on the one hand, it was incredibly thorough, this process, both on my part and theirs, I would say. And then it just clicked and became incredibly easy and simple and straightforward. Wow, wow, yeah, their chemistry is incredible in the film. And I know you guys spent about two weeks rehearsing and prepping prior to shooting, which I know isn't always common, and I think that's really cool you took the time to do that. Was there anything that happened in those rehearsals that maybe influenced a change than from something you originally thought that it was gonna be a certain way? Yeah, well, on a film like this with these two leads, I knew that there was gonna be a point at which I needed to be the boss or sometimes just sort of have a firm hand on things. And I knew that these two weeks were really invaluable for us, both in terms for the two of them to really get to know each other and to really feel comfortable with one another, but then also for me to give them an opportunity to challenge anything that was in the script, anything that was part of the plan for the shooting of the film, I needed to give them a lot of agency because I needed then to take it away from them once we started filming in so many ways. And this was an opportunity for us to sort of like, it was almost like the whole thing was like an open source code. And for two weeks, the three of us really worked together to devise what this thing was gonna be. We tried different avenues, we tried different ways of doing it. We blocked scenes, we ran scenes. There are a few scenes in the movie that are as filmed and as edited are exactly how we rehearsed them in terms of the blocking, in terms of what this thing is about. There's this lovely tiny little moment in the scene where in Alex's bedroom, which is one of my favorite scenes in the movie for them. And it's in Alex's bedroom after they hook up for the first time. And the blocking in the movie that you see is precisely what we did. It was the very last day of rehearsals. And this little sort of moment where they talk over each other near the end of it and it's kind of suddenly gets awkward again. That just happened one day in rehearsal. And I remember clocking that. And on set, I actually was, I had a video of the rehearsal and they did it. I showed it to them before we shot the scene. I'm like, do you remember this from nine weeks ago? And so I come from theater. I, you know, rehearsals are invaluable for creating, for inventing. There's some, there's, there are times and especially on a film like this where your ability to invent on set is very limited. And I needed to get their imaginations firing. And I needed that to allow my imagination fire too. So I think it's what made that, those two weeks are absolutely what made, what is special on screen between them possible. And what I love about you is I could feel it through the screen. You have so much pride in the work that they did. You're beaming when you talk about it, which I think- I feel like a proud parent. I really do. Because I mean, the thing is, is that this movie is only as good, this movie would only ever been as good as my ability to get natural, easy performances out of them. And one of the things that I'm really, really proud of in this film across the board is how relaxed everybody is. And it starts with Taylor and Nick. There is such an ease about them that really just permeates every scene of the film. And yeah, I'm incredibly proud. I think one of the great pleasures and challenges of this process was editing the film because it was a wealth of options. And there's a whole other version of this movie, which I could assemble out of alternate takes. And it would be a different movie. Absolutely very proud of those two. Yeah, I think a lot of people want to see those deleted scenes. Let's get the non-deleted scenes out into the world first, and then we'll see what happens. Fair enough, fair enough. Hey everybody, it's LeVar Arrington here, shouting out my peeps at Toyota Trucks for keeping the winning spirit going. Toyota is known for being reliable, durable, and rugged competitors, and now they are efficient too. Like the new Electrified Tundra with its iForce Max engine, making it more powerful than ever before. But it doesn't stop there. It has a spacious and high-tech cabin with features like panoramic view monitoring, giving you a 360 degree view around your vehicle. Or check out a Tacoma with advanced off-road features like crawl control and multi-terrain select. It will get you anywhere you can imagine. Or go with a 4Runner, the legendary bad boy that absolutely never gives up. With chops like these, it's no wonder these trucks hold on to their value year after year, which pays off for you in the long run. So harness your winning spirit and get yourself a Toyota. Find out more at Bayatoyota.com and let's go places. University for Working Adults. Start your comeback at PurdueGlobal.edu. He'll forget about the video game you gave him on his birthday. Wow, thanks, Grandpa. But he'll never forget how you invested in his future with the U-Nest app. Wow, thanks, Grandpa. Don't just give them any gift. Give them a gift that can grow with them. Invite grandparents and family friends to contribute to your child's future with the U-Nest app. U-Nest is an investment account for kids that makes it easy to gift funds that can be used for college tuition, their first home, and more just by sharing the link. Or include a U-Nest QR code on party invitations for birthdays and holidays. For a limited time, download the U-Nest app and use the code IHeart50 at signup to receive a $50 bonus when you fund your account. That's code IHeart50 when you sign up at unest.co for a $50 bonus. See terms and conditions at unest.co. There was a moment in the film for me that blew me away between Nick and Taylor. For you, I'm sure this is such a tough question. There were many, but is there one moment that you're just so blown away by? There are so many. I did give the example of that scene in the bedroom, which is just, for me, in terms of their chemistry, is so beautiful. I have to say that the confrontation scene in Henry's bedroom was, I think it was something that we were all dreading at filming because we knew what it was gonna cost all of us. And I knew that, I mean, practically speaking, as a filmmaker, I knew I had other things to do that day, so I also couldn't indulge in too long a process on set for that scene. But I also knew I couldn't leave until I got what I needed. And we did it maybe two-thirds of the way through the shoot. And it took longer than we expected it to. And actually, there's a couple of things that I didn't shoot that day because I just cut them right out. And we had to break for lunch. And we hadn't finished the scene. And I was really, really worried that we were gonna come back from lunch and I was just gonna have lost them. And we would never recapture what was happening on set before lunch. And it was the pivotal part of the scene is the end when Alex Nixis ultimatum to Henry. And we got back on set and we got, we started filming again. And instantly in the first take, after lunch, Taylor started crying. And Nick was facing away from him and he heard Taylor and Nick started crying. And the back half of that scene is so beautiful because they're doing such great work. And I really had a difficult time cutting it because there was such beautiful nuance work from both of them. But what to me was so remarkable about it is they had just had lunch. And they came right back into it and they were more dialed in and they were more in touch with each other than before. And it was truly, it was pretty remarkable. And I have to say that was the moment I knew that whatever happened with this movie, those two actors would be fine in their careers. Yeah, yeah. That was the scene I was thinking of as well. It was pretty remarkable. I can't wait for people to see that one. Was there a scene or two from the book that you thought, okay, man, I better get this just right? There was, well, the cake scene, of course. I think that for many reasons, it's the opening of the film. It really establishes the character so much, but it's also just the most iconic moment in the book, one of the most iconic moments of the book. And so there were a million reasons why I knew I needed to get it right. And it was also the most technical thing I had filmed up to that point. I think we shot it in our second week. And the first few days of filming were pretty gentle on me and everybody. And then we had this two-day shoot inside the ballroom with this cake, with these extras, with all of these other scene elements that were happening. And then on day two, we had to drop this cake and get them all mucky and it had to be funny and it had to be technically accurate. That was the one that I was really, really uptight about because there was no margin for error and there were lots of opportunities for error. So that was the most technical filmmaking we did on it. And the funny thing is, is that when it came to the actual shot of the cake going into their faces, because that whole cake was foam, rubber and latex. And so for the most part, the cake is phony and it's a fake cake. And so we could do a lot with it and drop it and it just bounced and then you could drop it again. But when it came to getting them dirty, we had a couple of duplicate costumes for them and there was a plan to get them showered and hair and makeup redone as fast as possible. But I just knew that I was gonna lose too much time and I needed to just get it done in as few takes as possible. And it was me and my production designer off camera and we were, you know, at the counter three, we threw the cake and the icing into their faces and it was a bullseye. Wow. It was a absolute bullseye and we watched it and we just decided to keep moving on and we had it. So I lucked out. That was the luckiest break on this entire film was getting the cake in their faces. The first take, the first and only take. Yeah, that was it. And then the one that I was really excited to do was the V&A scene at the Victoria and Albert Museum, scene at night in the museum. It just- Beautiful. That was the scene. That's my favorite scene in the book. And- When he clicked that music on, I was like, oh, come on now, come on. Yeah, yeah, yeah. That was the one I was most looking forward to. That was, we were locked into the V&A overnight. We had it all to ourselves. It was pretty magical and it was just the two of them. There were no extras. There was a very, the crew, the crew, we were just all like a family at that point. And so it was a real night at the museum. And then picking that music, because I know in the book it's Elton John's, Your Song, and which I knew instinctively wasn't gonna work for us in the film. It just wasn't the right sound. And so we auditioned a lot of different songs, and on set we used that one. We used the Perfume Genius. And we had, my Perfume Genius was gonna do a new cover of an older song for us that we really were excited about. And then I cut together the assembly of the film and we watched the scene with Perfume Genius's Can't Help Falling in Love. And we knew it was the right song and it was perfect. And so that was another lucky break because the song that we just decided to use on set was the song we ended up using in the film. I think that song's gonna soar to number one when the movie comes out. I hope so. It's a beautiful recording. It's an absolutely beautiful recording. Absolutely beautiful. And I have to tell you, when I put up a story on Monday night saying that I saw the movie and I screened it and it was great, I had so many people message me, people I haven't even spoken to in forever. And I was shocked at how many of those people were straight. This story, this book has such a built-in fandom from all areas and walks of life. I don't feel like you're the type of person that lets that pressure sneak in when you're making your art, when you're making your project, when you made the movie. But how do you kind of not let that cloud your mind when you are creating this movie knowing that there's so many people who are waiting and wanting and loving this? I learned, I think I learned in theater that worrying about what other people think is just really a pointless exercise. You really, you only have, especially on film, you only have one chance to get it right. You're only on that set one day, you gotta move on to the next scene. You're always just moving forward. And so you really, on a film set, you are living in the present. There's no past, there's no future. And that is actually incredibly helpful for focus. And I knew that, I think it's just sort of the tightrope thing. If you look down, you're gonna fall. I didn't think about ultimately what anybody would think of the film. I just kept following my gut and following my instincts. I knew, I knew this story. I knew, and look, it's my version of Red, White, and Royal Blue, right? It's not anybody else's. It's not even Casey's. And Casey will be the first to admit it. Casey's book is Casey's book, and my movie is my movie. It's my movie based on Casey's book. And it is my reaction to Casey's book. And the things that I love about Casey's book are what I put into the movie. And I knew that I would own it regardless. So I might as well do it in exactly the way that my instinct tells me to do and not worry about what other people would think. Man, that must be incredibly freeing. And I read a quote you gave in a different interview, and you said, love it or hate it, it's the movie I set out to make. That doesn't always happen. I love that quote. Yeah, it's true. Look, the one thing that is really true about this process is that I was surrounded by incredibly talented people across the board. This cast is a dream cast. I worked with one of the legendary cinematographers in the business. I mean, Steven Goldblatt was the cinematographer for Angels in America. And in addition to the cotton club, which is a forgotten gem of Francis Coppola's. But I never ever felt as if I had to do this on my own. And I never felt that I did not have my... It was really remarkable that every single idea I had was executed perfectly. And look, the things that we knew weren't gonna work physically or within budget, we adjusted, because that's just filmmaking. But it really, the movie I dreamed of in my head when I started working on this film is largely up there on the screen. Hey guys, Mario Lopez here to talk to you about some seriously cool rides that are taking technology to a whole new level. The Toyota Camry, Corolla Cross and Crown. Toyota is a legend when it comes to reliability. And that's where the Camry absolutely shines. Its sleek look and sporty suspension, available with all wheel drive means this car does all the hard work for you, letting you sit back and enjoy the ride. Or check out an efficient new Corolla Cross now available as a plugin hybrid for an eco-friendly twist on Toyota's favorite new crossover. Or go with a luxurious Toyota Crown. It's efficient, decked out in premium amenities and looks incredible. And every new Toyota comes with ToyotaCare, a no cost maintenance plan. So don't wait, head down to your local dealer for a test drive and to check out all the other high tech options Toyota is bringing to the table. Visit buyatoyota.com for more Toyota Let's Go Places. You're ready for a comeback. And with Purdue Global, you can do more than take classes. You can take charge of your story, of your career, of your life. Earn a degree you can be proud of and get an education employers respect. It's time, your time, not just to go back to school, but to come back and move forward with Purdue Global, Purdue's online university for working adults. Start your comeback at purdueglobal.edu. He'll forget about the video game you gave him on his birthday. Wow, thanks grandpa. But he'll never forget how you invested in his future with the U-Nest app. Wow, thanks grandpa. Don't just give them any gift, give them a gift that can grow with them. Invite grandparents and family friends to contribute to your child's future with the U-Nest app. U-Nest is an investment account for kids that makes it easy to gift funds that can be used for college tuition, their first home and more, just by sharing the link. Or include a U-Nest QR code on party invitations for birthdays and holidays. For a limited time, download the U-Nest app and use the code IHEART50 at signup to receive a $50 bonus when you fund your account. That's code IHEART50 when you sign up at unest.co for a $50 bonus. See terms and conditions at unest.co. Well, and one thing I love that you chose to do, I imagine pretty strategically, is this movie doesn't shy away from being sexy. You have these intimate scenes and they're beautiful, and you actually feel like you're watching a couple having a loving moment. And sometimes I feel like in content that's for the queer community, you kind of get the watered down version of that. And you don't always get to see those moments of true deep passionate love. Was that something important for you to show between the two gentlemen? Deeply, deeply. I think one of two things usually ends up being true. Not always, and those other movies and those other scenes stand out as a result, but either it's a scene that is, you can tell it's a straight filmmaker making the scene, or you know that it's a straight audience for whom the scene is being ultimately considered. And it's sort of like, generally I think in the past, a lot of it is, especially in studio movies, a lot of it is, you know, don't scare the straights. And there was none of that on this film. And I don't know if it was because, I don't know, I don't know why, but I did not get any resistance to my plans for this thing. I also made it very clear at the beginning, I said, you know, if you hire me, this is gonna be in the movie. So if you don't want it to be in the movie, you should find somebody else to make this film. And I was very upfront about it, because I didn't wanna have any arguments later. And what was really important to me is, I really wanted to do two things, which I had never, I hadn't seen much of in film. I wanted to show two men having sex in a way that is loving, that is connected, that is pleasurable, and that is beautiful. And I also wanted to film a sex scene whose geography and whose physical execution of makes sense to people who know how to have gay sex. So I needed it to both be incredibly accurate physically, and I also needed it to be incredibly to the point where we are in the story. I needed it to be focused on the characters, I needed it to be focused on their journey. And so we applied both seemingly oppositional desires to the scene, and it ended up being the scene that's in the film. Yeah, well, they're beautiful scenes. I'm happy you stuck to your instinct and your guts on that. I was surprised that the movie, and I know you share the same sentiment, got a rated R, I guess, because of the sex scenes, but that surprised me. Yeah, I mean, I say it surprised me, and then also it didn't surprise me. It's sort of like, I think in the perfect world that maybe sometimes still exists in my head, it surprised me, and then in the reality that I live in, it didn't, it's not surprising at all. It's, I think it's just, it's two things. It's, I just, if it had been a man and a woman, if it hadn't been a gay couple, I really don't think that scene would have garnered the R rating. But let's even pretend that that, that maybe it would have. What is more depressing to me actually is the fact that it is sexuality that got us the R rating. And you can name a dozen movies that are incredibly violent, far more violent movies than my film is sexual, that RPG 13. So I think even if you set aside latent homophobia or overt homophobia, you're still left with the problem that the MPAA favors violence over sexuality. They prefer American audiences see acts of violence than acts of love. And that's really fucked up. And I think that it's, it may be overdue for a reassessment of the use of the MPAA. I don't know what its function is anymore. And I think it might be a little outdated. Yeah, yeah. Well, which is all the more reason why a movie like this is important with the choices you made artistically, because it's gonna show people that this is content people wanna see and they're gonna line up to see it and there's no problem with it. So, you know. We aren't living in the same country that we did when the MPAA was. Right, right. And I feel like the standards are still being applied to probably, I would imagine the 1960s or early 70s is when the MPAA was probably founded. I don't know that off the top of my head, but we're not living in that world anymore. And I don't see anything in this film that actually anybody who isn't at least 13 couldn't watch, you know? Yeah. So, but hey, that's me. What do I know? No, I agree. I think it's a film for everybody. And like I said, I'm glad you made the choices you made. Matthew, I imagine doing a movie like this is so gratifying on a million different levels and in a million different ways, but personally, what did you learn about yourself through making your very first movie like this? Well, I learned that I could get by on a lot less sleep than I ever imagined. I, look, I think that Hollywood has for the last several years been going through a reassessment of what is acceptable behavior for people with power. And there is no person in Hollywood at a certain point in any filmmaking process more powerful on any given day than the director of a film. And my two mentors in this business were Stephen Daldry and Tom Fontana is one of the great TV show runners. And they both operate in the world from a place of kindness. And they operate in this world from a place of really wanting to help people do their best work. And when you're working with Stephen or you're working with Tom, you're working hard, but you're always valued. You're always asked how you're doing and you're always having fun. And it was something that I think I maybe unconsciously brought with me into the process of doing this. And there were days when I was frustrated. There were days when I got angry. There were days when something didn't work and it was somebody's fault. And you could actually find someone to blame for it. And my instincts always in this time of stress are to get angry. But my actions I learned were much more effective if I didn't. And it's so easy to be awful. And it is so hard sometimes to be kind. And yet I discovered through exercising the lessons that I learned from Stephen and Tom on hopefully a daily basis, that you really, really do get the best work out of people if you create a warm, loving, safe environment for them. You can push them harder to do scarier things. You can make something that is seemingly impossible possible. Weirdly, I also think it saves you time. So I learned about myself that my mentors were right. And that I also learned about myself that I have more of a capacity to be understanding of people than I ever imagined. And I know that sounds like I'm in some ways boasting or tooting my own horn or whatever, but I think if anybody who knows me knows that I'm, I'm pretty driven and I can be tough and I can be tough on myself. But I hope also that people know that I, I hope I have a reputation for being loving and kind and caring. And that battle within anybody between those two instincts, I sort of wage that internally on this movie and love, love always wins. Oh man, that's beautiful. I love that. Oh good. I do, what a great realization to have through doing your work. That's so cool. And I think, man, we all need to tap in some more of the kindness thing in this world and society. Very important. Yeah, it would be nice. It would be really nice. And it applies in all things and in all ways and not just in this business. And it applies to our discourse and the way we treat other people on social media, the way we treat other people at the supermarket. Everywhere. Yeah, right on with that. Matthew, the last question for you is based off the title of the show, which is I've never said this before. So I would love to know something that you have never said before that you would like to share. It can be deep, it can be silly, it can be anything you want. I've never said this before, but I used to want to be president of the United States. Did you really? I really did when I was about, between the ages of about 15 and 17, maybe 18, I just fell so passionately in love with politics. And I was a big, I read the New York Times at that age and I watched CNN constantly. And I just wanted to be, if not president, then like proximal to the president or maybe a senator or a congressman. I just wanted to be in politics. And then I discovered that I liked kissing guys. And at that time in my life, in that time in this country's life, I knew, well, I could either kiss guys or run for president and the boys won. What can I say? So it's funny because when I was thinking about that question, I was trying to figure out what's, how to answer. And I remember giving an interview about being on the Oval Office set. And I just, I remember actually sitting behind the desk, you know, before work one day and just thinking, I remembered in that moment how I had these dreams of like, I wanted to go to law school. I planned it all. I was gonna get into politics. And then, you know, summer of 95 happened. And I just. Well, I mean, you can never say never though, right? You know, I mean, sure, never say never. I'd rather maybe make donations to queer candidates and let other people do that themselves. Fair enough. That's an awesome answer. So were you geeking extra hard at Uma Thurman as president? My God, are you kidding me? It was like, I think Uma and I were both geeking together about it. Like, Uma would never say this, but I saw her sit behind that desk. And she sort of like, she had an idea or two about what she could do after this movie. I think that what I absolutely can say, even on a soundstage in London, you walk into even an approximation of the Oval Office and you really do feel this immense sense of power, this immense sense of history. And I mean, it was like plywood and like fake, like really cheap carpeting. And yet still, you can't help but be awed, you know? But I do think that Ellen has a much better sense of style than Joe Biden. I would agree. Well, listen, if in a few years from now, 10 years, 20 years, I see your name in the race, I'm gonna pull this interview and say, see? See? You do, and then I'm gonna come to you for big donations. All right, fair enough. Matthew, this was awesome. Like I said, I love the movie. You did a fantastic job. I think you're such a brilliant artist. As we close out the episode, tell people when, how, where, how to watch this film, all the things. Red, white and royal blue on Amazon Prime starting August 11th, everywhere in the world. Amazing, thank you, my friend. This was so much fun. Yeah, I really appreciate talking to you, thank you. I've never said this before, is hosted by me, Tommy D'Addario. This podcast is produced and edited by Mike Cascarelli and executive producers are Andrew Puglisi and Katrina Norvell at iHeart Radio. I've never said this before, is part of the Elvis Duran Podcast Network on iHeart Podcasts. For more, rate, review and subscribe to our show. And if you like this episode, tell your friends. Until next time, I'm Tommy D'Addario. I'll see you next time."}, "podcast_summary": "In this episode of \"I've Never Said This Before,\" host Tommy D'Addario interviews Matthew Lopez, the director and screenwriter of the film \"Red, White, and Royal Blue.\" The film is an adaptation of the bestselling novel by Casey McQuiston, and it is a queer love story between the son of the American president and a British prince. Lopez discusses his passion for the book and his desire to create a film that portrays a queer romance with a happy ending. He also highlights the chemistry between the two lead actors, Taylor Zakhar Perez and Nicholas Galitzine, and the importance of showcasing loving, intimate scenes between two men on screen. Lopez shares his experiences and insights gained from directing his first film, including the importance of creating a kind and supportive work environment. He also reflects on his own aspirations to be involved in politics when he was younger. The film \"Red, White, and Royal Blue\" is available on Amazon Prime starting August 11th.", "podcast_guest": "Matthew Lopez", "podcastGuest": "Matthew Lopez  (born December 12, 1987) is an American mixed martial artist who competed in the bantamweight division of the Ultimate Fighting Championship (UFC).", "podcast_guest_org": "", "podcast_highlights": "In this episode of \"I've Never Said This Before,\" host Tommy D'Addario sits down with Matthew Lopez, the director of the film adaptation of the bestselling novel, \"Red, White & Royal Blue.\" They discuss the process of bringing the book to the big screen, the casting of the lead actors, and the importance of representing authentic and loving queer relationships in media. Matthew also shares his personal journey of self-discovery and the lessons he learned about kindness and leadership during the making of the film. \"Red, White & Royal Blue\" is set to premiere on Amazon Prime on August 11th."}