{"podcast_details": {"podcast_title": "The Nerd Book Review:The Tractor Seasons", "episode_title": "The Lost War", "episode_image": "https://deow9bq0xqvbj.cloudfront.net/image-logo/1631562/icon_2.png", "episode_transcript": " Hi, this is Cam from the Nerdbook Review, where we strive to broaden your fantasy horizons. Today I will be reviewing The Lost War by Justin Lee Anderson. Justin spent 15 years as a professional writer and editor before his debut novel Carpe Diem, which was published in 2015. It became a bestseller and won a 2018 Audi Award. His second book, The Lost War, was shortlisted in the 2019 Book Nest Award and won the 2020 Spitbow Competition. A new release is coming from Orbit Books as the first book in the Eden Saga. It is 529 pages long and was first published in August 30, 2019. Like I said, the book was picked up by Orbit, the series was, so he has done well with this. I feel like the Spitbow Competition is a place where Orbit definitely picks up books from. Some of my favorites from past competitions have been picked up by Orbit. We're going to have a cut in hopefully from Chris here. I asked him if he would be so kind as to read the book blurbs for me since I don't like hearing myself do them and he has that silky smooth voice. So hopefully here is Chris reading the book blurb. The war is over, but something is rotten in the state of Eden. With a ragged peace in place, demons burn farmlands, violent reavers roam the wilds, plague has spread beyond the black meadows. The country is on its knees. In a society that fears and shuns him, Aranok is the first magically skilled druid to be named King's Envoy. Aranok is now charged with restoring an exiled foreign queen to her throne, who leads a group of strangers across the ravaged country. But at every step, a new mystery complicates their mission. As bodies drop around them, new threats emerge and lies are revealed. Can Aranok bring his companions together and uncover the conspiracy that threatens the kingdom? Hop in for this twisted fantasy road trip from award winning author Justin Lee Anderson. My take then after hopefully I had Chris in there. In a grim dark land beset by all manner of nefarious creatures and evil plots, our heroes must fight those creatures and unravel said plots in order to save the land. That's a good little review. Now let's talk about a few things before I get into the book itself. First off, hopefully we are not hearing too much of the sound of that crazy air conditioner. While I am recording at 5 o'clock in the morning, it only got down to 75 degrees Fahrenheit last night. And a fun little fact with a tractor, yes the engine sits in front of you but underneath you is the very large transmission, PTO, all that stuff that makes your tractor move forward and makes your equipment move as well. Sits right underneath the cab of the tractor. So if I'm not running that air conditioner, it's 75 outside and 95 in my cab even at 5 o'clock in the morning. A fun little tidbit, I guess as long as I am running this tractor bit here, I might as well give the occasional fun fact about it. With these giant windows that cover a good deal of the cab, the windows basically all around you, you get a little bit of a greenhouse effect to go along with that transmission being right underneath you. And often times even in the middle of the winter when it's like even if it's zero degrees Fahrenheit, I still have my windows open on a sunny day and am not running the heater after you warm it up first thing in the morning just because of the way that greenhouse effect works in these things. And it's kind of a weird deal where I'll have times where on like a partly cloudy day, it'll be sunny and I'm hot and I'll have the windows open and then it gets cloudy and a few minutes later I notice that I'm freezing cold and then I have to shut the windows and turn the heater back on and I will sometimes do that on and off all day long. Now I know that you should think that there would be like climate control but I swear that they just don't work. I don't know if it's because of the warmth or what it is, the sun, you're not moving fast enough to cool things down but I just, I've never been able to get that climate control in any piece of equipment whether it's several different loaders, excavators, whatever I'm running. So I basically just turn the heater on and off all day long and open and close windows while I'm running equipment in the winter. Summertime as soon as that sun comes up, you're running that air conditioner right away. Now the last book that we did which is the first real review I did, Small Miracles, I think it turned out alright. I'm fairly happy with it, obviously I still think that it would be a lot better to be able to have the group but I'm not unhappy with the review. Okay, let's get into The Lost War by Justin Lee Anderson, the review. As I gave you my take on it, the grimdark land, beset by all kinds of bad things, this is definitely a grimdark book. The book takes place in a secondary world and we are in the kingdom of Eden. We are told that a year ago they won a war against an evil druid who was the first druid who could use two types of magic. Most druids are only able to use one, I'll go more into that once I get the scene set up a little bit better. But this evil druid could use both necromancy and summon demons, those are two different things, two different types of druids. The kingdom of Eden, they won the war but they didn't win it cleanly. There are still demons roaming the land. The original capital was overrun we're told and half the population was killed as they were evacuating it and moving the people to the city that is now acting as the capital. So that city is now overcrowded. There are demons in the breadbasket of the kingdom so our party that ends up being formed will actually fight some demons there in this breadbasket and they'll try to kill some of them to help things out. So like I said, the land is not healthy and clean. There are demons, as I've said, there's reavers, they're just called reavers, they're humans, I think of them as barbarians. The group that will form will have to fight them at various times. As I said, there's necromancy so there are corpses that are brought back to life, they're animated corpses. Then there's another group called the blackened, they're basically zombies. They just have to touch your flesh with their hands and you become a zombie. They're kind of like the most terrifying to the people probably. I mean, demons obviously are scary and they're awful but you can fight them. The blackened, all you have to do is be touched by them on your skin. So like when they fight them, you want to make sure you're fully armored, have a visor, and there's no skin that is clear. The magic system is pretty well put together. There are druids, there are different types of druids. Our main protagonist, if you will, Aranok is his name, he's the king's envoy so that makes him the second most powerful person in the land. He is an earth druid so he can use elements, he can use fire and water, wind, he will use them all to effect. He can also manipulate the land so at one point he's going to raise a berm of earth to kind of protect them, kind of like fort walls if you will. The druids, as they're called, they are not well liked by the populace. People don't like that they can use magic. Until Aranok and the current king overthrew the previous king because he was so corrupt and wasn't treating the people well, druids were actually outlawed and they could be killed. We find out throughout history they've been murdered and kind of like, there's a scene in the book that's kind of like where we go to flashback to the past where we see kind of a Salem witch trials type of a thing because of druids. So druids are not like so overpowered that they are just like a complete force unto themselves. Aranok is the most useful in terms of like an actual battle magic which is an earth druid but we're going to be introduced to a whole bunch of different types. Like I said, I mentioned that demon summoners are one type of druid, necromancers are another type of druid, we'll see time druids, I mean we'll see all kinds of different druids that can do different things. But using the magic will tire them out and that's why Aranok, the second of the big characters that we're going to see with Aranok is actually his bodyguard. So even though he's so powerful, if he uses too much of his magic then it will tire him out and he can even pass out from energy loss. They'll recover, it's not like it's draining his life force permanently but it does take some time. The more magic you use the longer it affects you. So a good solid magic system, I would call it more of a hard magic system. We don't necessarily get all the rules explained to us but it's not like he's making up things on the fly to help people out as some magic systems do. Okay, we're going to take a quick little break as I get to the end of a row and I will be right back. And I'm back from switching rows. Okay, as I have told you the story takes place in Eden right after this war and we do have multiple point of view characters, most of those characters that we are introduced to will be part of the King's Council. They're being sent on a mission to retrieve a queen. We'll find out pretty quickly that while that is their main mission an awful lot of stuff has happened and will happen to them during the books and honestly dealing with the queen kind of becomes a secondary thing a lot of the time. Really only one of the characters really cares that they go find her. Everybody else kind of seems to have their own thing going on and a lot of the events that happen will sidetrack them as they kind of see this evil plot that's going on to destroy the kingdom again. And so while the blurb that Chris read to you is the book blurb it's kind of a secondary to the main storyline which I won't actually get into too much because that is very spoilery. I will say there's lots of twists and turns in the plot but let's go ahead and talk about the characters and that kind of stuff but not too much into the storyline itself. So as I said multiple point of view characters. The first one is said Aranok. He is that powerful earth druid. He's the king's envoy. He and the king overthrew the previous king because the previous king was corrupt and they thought that they could do a better job for the people. They did a better job until this war happened and now they're trying to put the pieces back together. Our second big character is Elandria. She is that archer and also Aranok's lover. She's super important to the storyline and to him. She keeps him alive more than he keeps her alive for sure throughout this storyline. Our second point of view character though is Nerea. She's a ship's captain. She serves on the king's council as well. She was a pirate. We'll find out her back story basically that she was an orphan and had to raise through the rough and tumble world of pirates to become that ship's captain. So she's definitely tough. She is competent. She's a competent swordswoman as well. She's kind of more like a light infantry if you will when she's fighting on land. Then we have Vastan who is a 15 year old blacksmith. She's definitely the weak spot of the party as they move along. As I said Elandria already. She's the archer. Samali is a 19 year old girl. She is a knight and a member of the White Thorns. The White Thorns are their best warriors in the realm. They've also got special armor and weapons that both protect against demons and kill them more easily. So like right off the bat when we meet Samali she's able to like cleave through a tough demon armor with like one sword swing whereas everybody else is battering at them and hoping to chip their way through before the demons get them. She is the most powerful of the fighters in the group. She's definitely single minded in her love of the order of the White Thorns. She's also very religious. We have the White Thorns worship just a god that they believe is good. Like the Christian god, not the Old Testament version, the New Testament version. But we don't ever see that god. It's not an active part. It seems like an awful lot of the people in the Kingdom of Eden itself are not particularly religious. Maybe that's because of the war that just happened or the way their lives are. But other kingdoms we're told that we don't actually see are far more religious. She's going to be protecting another member of their group who's actually also on the council named Maristan. He's a monk and the leader of the White Thorns. Monks don't actually fight. The knights do the fighting. The monks do the commanding. So we're told that Maristan was the person that led the White Thorns and the Kingdom kind of as its war council, as they fought the evil druid that could do necromancy and demon summoning as we're told through the war that they just got done with. It's funny because at first glance the group really seems like a D&D cast. We have our D&D group. We've got a druid, an archer, a monk, a paladin, a sailor, a soldier, and a blacksmith. It certainly doesn't feel like there is a D&D set up. The cast, like I said, they're supposed to be on a pretty straightforward mission of retrieving a queen and taking her back to a port city to be taken back to her kingdom. But like I said, that kind of becomes a secondary thing pretty fast. It is a very entertaining storyline. A lot of things will happen. One thing that's important to me, it's been important to Katie as we've gone through some of the books we've read, that women are not just secondary damsels in distress. In fact, all of the poor decision making that's done is probably made by the male characters, especially Aranok and Glorbad, who tend not to get along very well. Glorbad is the one that's really gung-ho-rah-rah that they should be doing the mission. Aranok has a lot of doubts from almost the very beginning, and he kind of wants to go off and figure out what this conspiracy that he seems to find is before he worries about the queen. Same with Maristan. He's having a crisis of faith, and Samalee is definitely important to protect him as well. She's not on the council, but she's like his bodyguard, kind of the same way that Elandria is for Aranok. Aranok is the other one that'll make poor emotional decisions. So you have Elandria, who basically keeps him alive with her good decision making to counter his poor decision making and impulsiveness. Same with Samalee, keeping Maristan alive. And Nerea does the same thing for Glorbad, who is definitely dealing with PTSD from the war. Like I said, the females are generally the ones that are the glue that hold the thing together. Like they're usually the ones that are the glue that hold the families together in real life. So no damsels in distress here. If you like strong female characters, then this is a good book for you. I think that that pretty well sums up the cast. Like I said, multiple points of view, a good magic system with the druids who are powerful but not overpowered. And we're dealing with a grimdark secondary world with demons running around. And also our blackened zombies. And we don't see too many of the undead that have been raised by the necromancers, but we do see them at one time. Getting into our thoughts on the book, the recommendation phase and all that kind of stuff. I had to stop listening to the audiobook, maybe less than an hour in. The narrator had a real bad habit of, so say here's an example. So we'd have dialogue from character A. So character A would say, we really need to get to this place quickly. Character A said. Then you'd have character B respond, well I would like to go off and look at this first. Character B said with reticence. But there would be a long pause in between when the dialogue and that part were character A said in the writing. And I told my wife about this and she's like, oh so basically it's like how I have to deal with listening to you when you're telling a story, when you space off for a minute and I'm not sure if you're done talking or if you've just kind of forgotten where you're at or you're going to continue on so I just stay quiet. So I just couldn't handle that pause. So I listened for five chapters and I just stopped. And I got a copy of the book and I started reading. And also that made me think about the fact that I still do prefer reading. I don't care that I have a harder time reading in this tractor while I'm composting. I do have a lot more breaks and interruptions but I still feel like I just do a better job of understanding what's going on when I'm reading. I'm glad that I listened to that first part of the audiobook to get some names correct because the Scottish names both for the characters and for the places would have been real hard for me. I definitely based off of spelling would not have had any of the characters names or the place names right. That would have been tough. But this audiobook like I said did make me realize pretty quickly that I am going to go back to reading now for most of my books. If I'm re-listening to series like I listened to Malazan twice and The Wheel of Time twice and that was fine. The last one I did, The Small Miracles was perfect on audiobook. It was set in contemporary London. There weren't a whole bunch of characters I needed to know. That basically was perfect for it. But from now on if I'm doing epic fantasy or anything like that, I'm just going to go back to reading. I've read three books in the last little bit. It's a lot easier to read books too time wise. I'm a much faster reader than I'm going to be listening. But getting into the book itself once I started reading, I was a pretty big fan. I had trouble figuring out where things were on the map because they are on a journey. That's always a little bit of a struggle. I felt like the author did a great job of getting the magic system explained. We got the kingdom figured out. He gave us all the info we needed in a way that was pretty easy to understand and didn't take hundreds of pages to figure out. I always think back to one book, the Tad Williams, The Dragon Bone Chair, how I almost quit reading in the first 200 pages because it was literally just nothing but a non-stop info dump and nothing at all happened. It was just so boring that if I hadn't heard such good things about it and it wasn't such a legend in fantasy circles, I probably would have stopped. Then it ended up being three more books where there was like three or four thousand pages where they literally never stopped adventuring. It was amazing. This is one of those books where we learn things happen in the past. We learn about the world and the characters as they're adventuring so there's no dull point. There's action pretty much from the beginning to the end. It's entertaining. I can definitely see why Orbit picked it up. It's got plot twists and turns but it follows a pretty standard plot with a group put together. They're a likable group for the most part. Nobody that you just outright hate and that's doing completely stupid things. Everyone has the reasons for what they're doing. I also just enjoyed getting back into a grimdark novel. My first couple that I did were epic fantasy grimdark which is kind of my bread and butter. Those three female characters, like I said, were the smartest of the group and the ones that held things together. If that's important to you, that's good. How did it make us feel thing? I'm not going to try to pretend like I had a ton of feels in the book. I definitely cared about what happened to people. The backstory that they gave people was important and definitely fleshed them out. I think probably the character that I cared about the most, I guess if you will, was Sammily that night where I felt the worst if things happened to her or the best when things happened to her was definitely Sammily. But I didn't have any of the characters that I just outright didn't care about at all. Vastin, he's not very important to the group but he's still a character that he's likeable. I think that's the biggest thing. Nobody's going to make stupid decisions and that's one of the quickest ways to ruin things or to drop a point or two in a book for me. I think that the very first book that I listened to on audiobook and probably the reason why I didn't end up choosing it for a podcast is the main character sometimes just made really stupid decisions that weren't even in their best interests or the people that they supposedly love's best interests. That pisses me off in a book and this avoids that with these characters. Aranaut can be stupid at times, I guess, in terms of being impulsive and things like that but he's usually taking actions to protect the people that he cares about before he does those stupid things. So that's kind of one of those things that happens. Definitely if you like grimdark fantasy then this is a book that I think that you're going to really like. It is grimdark so important characters will die throughout the story which is another reason why it's important not to give out too much of the plotliner as things go. Just know that there's a vast conspiracy and that the main storyline will quickly devolve into other things as well. On the would you recommend to others thing, yeah, if you like grimdark fantasy I'd recommend the book. I definitely plan on reading the next book in the series. It's well written, there's twists and turns, there's a huge twist at the end that definitely made me go, man, that's cool, I didn't quite see that coming in that way and it's generally an entertaining book. Now on how would we rate it on a five star system, as I've had like a week or so since I read the book and I just didn't have time to write the outline which I have very quickly discovered is very important, I tried to do an episode on this one without the outline or just with my notes and I was just all over the place and it was pure garbage. So I finally had time to do the notes over the weekend and now I'm recording this on a Tuesday and it was, I definitely have to have an outline when I'm on my own. I think when there's more of us then I don't need the outline nearly as much but I absolutely have to have for that. So going on that five star rating system, even now I got myself sidetracked. So going back to that, I'm gonna give this what I'm calling my soft five, more of like a four and a half and reading another book, the next book that I did and the one that I'm gonna put out next for a podcast made me remember why I had my past hard five and soft five or whatever, hard four, soft four and that's because like I said, I really enjoyed reading this book, only took me a couple days to read it but I definitely was able to put it down and go to bed at night and I think that in the next book that I read, I couldn't put it down and so that's where my hard five and soft five rating kind of came into play that the one surefire way for me to have a hard five is if I stay up late to read it. So I think that the Goodreads rating is like a 4.35 I think. That's probably a pretty good rating on this. There's a lot of reviews on this one and a lot of ratings so it's not like one where there's only like 50 or 40 you know. So I definitely enjoyed it, absolutely recommending it to anyone that likes Grimdark and I think anyone that dislikes epic fantasy in general, I would even tell my wife that if she wanted to read this that I think that she would enjoy it. Now getting into who the main audience is and who should and shouldn't read it, the books are definitely geared more towards older teens and adults. There's nothing that's like too crazy triggering I don't think that I would have to give to a warning to specific groups. There's no rape, you know anything like that or like specific child abuse. You do have some children, baby zombies and blackened so obviously that's not fun but it's not, you don't see it happen directly. A general older teen and on audience. Getting into my closing thoughts then is that this is a good solid book, it's fun, it is one that I am glad that I read and I can absolutely see why it won fifth though. I look forward to reading more books in the series, be ready for that little bit of trouble with names and places to start off with because of the Scottish names. I think that once I get another few episodes banked I'll definitely go back and read the second book here maybe in the next couple weeks. The last thing to say is getting into the closing, my next book for the podcast will be In Solitude's Shadow by David Green. You can reach me through email at nerdbookreview at gmail.com, Facebook is Nerdbook Review, same with Instagram and whatever Twitter is being called now, all those are Nerdbook Review handles. Facebook, feel free to message me and feel free to send me an email, like I said nerdbookreview at gmail.com and let me know how you feel about the podcast and its current new format. This will be just the second episode we put out that way but like I said we're going back to reading books now, no more audiobooks unless it's not an epic fantasy style. If you're an author who are listening to this feel free to send me an email and I'll look at your book and see if it's something that looks like I would like to do. Thank you to everyone who's listening and I hope you all have a wonderful week. I will not be putting out an episode if you're listening to this right away, so the second full week of August. I'm going on a little mini vacation with the family and I won't have a chance to edit or put up a new episode. Alright. I'll see you guys next time."}, "podcast_summary": "Hello, this is Cam from the Nerdbook Review podcast. Today I will be providing a summary and review of the book \"The Lost War\" by Justin Lee Anderson. This book is a fantasy novel that takes place in the kingdom of Eden, which is dealing with the aftermath of a war against an evil druid. The story follows a group of characters, including the powerful earth druid Aranok, the archer Elandria, the ship's captain Neria, the blacksmith Vastin, the knight Samali, and the monk Maristan. Their mission is to retrieve an exiled queen and bring her back to her throne. However, their journey is filled with dangers, mysteries, and a conspiracy that threatens the kingdom. The book explores themes of power, redemption, and the consequences of war. It combines elements of grimdark fantasy with a well-developed magic system and engaging characters. The female characters in particular are strong and smart, taking charge in crucial moments and providing support to the group. The story is fast-paced with twists and turns that keep the reader engaged. The author's writing style is accessible and the world building is done effectively. The audiobook version of the book has a narrator who occasionally pauses between dialogue, which can be distracting. Overall, \"The Lost War\" is an entertaining and enjoyable read for fans of grimdark fantasy. I would rate it 4.5 out of 5 stars and recommend it to older teens and adults. Thank you for listening and be sure to check out the Nerdbook Review podcast for more book reviews.", "podcast_guest": "Justin Lee Anderson", "podcastGuest": "Not Available", "podcast_guest_org": "", "podcast_highlights": "Cam from the Nerdbook Review has given a comprehensive and positive review of The Lost War by Justin Lee Anderson. He praises the well-developed magic system, the likable characters, and the entertaining and action-packed storyline. Cam notes that the book falls into the grimdark fantasy genre and mentions the presence of demons and zombies in the story. He also highlights the strong female characters and the overall quality of the writing. Cam rates the book as a soft five or a four and a half stars out of five and recommends it to fans of grimdark fantasy. He plans on reading the next book in the series and encourages listeners to provide feedback on the podcast."}